#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.dns_a_record_set.home: Reading...
tls_private_key.this: Refreshing state... [id=dddfc5fef3bfb624f0f8d3fc136efae552ca0ec6]
data.dns_a_record_set.home: Read complete after 0s [id=capnduck.ddns.net]
module.http_https_everywhere.data.aws_vpc.this: Reading...
module.jelliott_records.data.aws_route53_zone.this[0]: Reading...
module.all_from_home.data.aws_vpc.this: Reading...
aws_key_pair.this: Refreshing state... [id=ec2-key-ssh]
aws_secretsmanager_secret.this: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:009727205366:secret:ec2-key-ssh-wLGmwY]
aws_ecr_repository.this: Refreshing state... [id=capnduck]
aws_s3_bucket.tfstate: Refreshing state... [id=capnduck-terraform-tfstate]
data.aws_route53_zone.this[0]: Reading...
aws_dynamodb_table.tfstate_lock: Refreshing state... [id=terraform-tfstate-lock]
data.aws_caller_identity.this: Reading...
data.aws_caller_identity.this: Read complete after 0s [id=009727205366]
aws_iam_service_linked_role.spot: Refreshing state... [id=arn:aws:iam::009727205366:role/aws-service-role/spot.amazonaws.com/AWSServiceRoleForEC2Spot]
module.capnduck_records.data.aws_route53_zone.this[0]: Reading...
data.aws_vpc.this: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-09289eb9291b2949c]
module.zones.aws_route53_zone.this["jelliott.io"]: Refreshing state... [id=Z04938253L3MEH8G7WE6R]
module.acm.data.aws_route53_zone.this: Reading...
module.http_https_everywhere.data.aws_vpc.this: Read complete after 1s [id=vpc-09289eb9291b2949c]
module.all_from_home.data.aws_vpc.this: Read complete after 1s [id=vpc-09289eb9291b2949c]
module.acm.aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:009727205366:certificate/8ce6a6a4-d99c-448c-b2df-8934053f664d]
aws_secretsmanager_secret_version.this: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:009727205366:secret:ec2-key-ssh-wLGmwY|512B8462-5E43-4959-9F6D-E69066DAC2F6]
data.aws_route53_zone.this[0]: Read complete after 1s [id=Z05346383CF9J3IH2UIOG]
aws_ecr_lifecycle_policy.this: Refreshing state... [id=capnduck]
module.ecs.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:us-west-2:009727205366:cluster/default]
module.jelliott_records.data.aws_route53_zone.this[0]: Read complete after 1s [id=Z04938253L3MEH8G7WE6R]
data.aws_vpc.this: Read complete after 1s [id=vpc-09289eb9291b2949c]
module.http_https_everywhere.aws_security_group.this: Refreshing state... [id=sg-0013e0e51b1939e0f]
module.jelliott_records.aws_route53_record.this["jenkins A"]: Refreshing state... [id=Z04938253L3MEH8G7WE6R_jenkins.jelliott.io_A]
module.all_from_home.aws_security_group.this: Refreshing state... [id=sg-0d859e28c6fb1bd67]
module.jelliott_records.aws_route53_record.this[" NS"]: Refreshing state... [id=Z04938253L3MEH8G7WE6R_jelliott.io_NS]
module.capnduck_records.data.aws_route53_zone.this[0]: Read complete after 1s [id=Z05346383CF9J3IH2UIOG]
data.aws_subnets.private: Reading...
data.aws_subnets.this: Reading...
data.aws_subnets.private: Read complete after 0s [id=us-west-2]
data.aws_subnets.public: Reading...
module.capnduck_records.aws_route53_record.this["drive CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_drive.capnduck.com_CNAME]
module.capnduck_records.aws_route53_record.this["webmail CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_webmail.capnduck.com_CNAME]
module.capnduck_records.aws_route53_record.this["_dmarc TXT"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG__dmarc.capnduck.com_TXT]
data.aws_subnets.this: Read complete after 0s [id=us-west-2]
module.capnduck_records.aws_route53_record.this[" TXT"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_capnduck.com_TXT]
module.acm.data.aws_route53_zone.this: Read complete after 0s [id=Z05346383CF9J3IH2UIOG]
module.capnduck_records.aws_route53_record.this[" NS"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_capnduck.com_NS]
data.aws_subnets.public: Read complete after 0s [id=us-west-2]
module.capnduck_records.aws_route53_record.this["groups CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_groups.capnduck.com_CNAME]
module.capnduck_records.aws_route53_record.this["sites CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_sites.capnduck.com_CNAME]
module.capnduck_records.aws_route53_record.this["calendar CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_calendar.capnduck.com_CNAME]
module.capnduck_records.aws_route53_record.this["mail CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_mail.capnduck.com_CNAME]
module.capnduck_records.aws_route53_record.this[" MX"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_capnduck.com_MX]
module.capnduck_records.aws_route53_record.this["subsonic CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_subsonic.capnduck.com_CNAME]
module.capnduck_records.aws_route53_record.this[" CAA"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_capnduck.com_CAA]
module.http_https_everywhere.aws_security_group_rule.egress: Refreshing state... [id=sgrule-3594773728]
module.http_https_everywhere.aws_security_group_rule.tcp[0]: Refreshing state... [id=sgrule-8720741]
module.http_https_everywhere.aws_security_group_rule.tcp[1]: Refreshing state... [id=sgrule-3558464871]
module.all_from_home.aws_security_group_rule.egress: Refreshing state... [id=sgrule-3062342158]
module.all_from_home.aws_security_group_rule.tcp[1]: Refreshing state... [id=sgrule-4022965131]
module.all_from_home.aws_security_group_rule.tcp[0]: Refreshing state... [id=sgrule-3287070106]
module.all_from_home.aws_security_group_rule.tcp[3]: Refreshing state... [id=sgrule-2814207979]
module.all_from_home.aws_security_group_rule.tcp[6]: Refreshing state... [id=sgrule-400863898]
module.all_from_home.aws_security_group_rule.tcp[4]: Refreshing state... [id=sgrule-2243982184]
module.all_from_home.aws_security_group_rule.tcp[5]: Refreshing state... [id=sgrule-3029087960]
module.all_from_home.aws_security_group_rule.tcp[2]: Refreshing state... [id=sgrule-1176284589]
module.all_from_home.aws_security_group_rule.tcp[7]: Refreshing state... [id=sgrule-3437537234]
aws_db_subnet_group.private: Refreshing state... [id=private]
module.ecs.aws_ecs_cluster_capacity_providers.this: Refreshing state... [id=default]
aws_db_subnet_group.public: Refreshing state... [id=public]
aws_s3_bucket_versioning.tfstate: Refreshing state... [id=capnduck-terraform-tfstate]
aws_s3_bucket_server_side_encryption_configuration.tfstate: Refreshing state... [id=capnduck-terraform-tfstate]
aws_s3_bucket_acl.tfstate: Refreshing state... [id=capnduck-terraform-tfstate,private]
aws_s3_bucket_public_access_block.tfstate: Refreshing state... [id=capnduck-terraform-tfstate]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-058df8cecce6d17b4]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-005425ea8ee4edd71]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0fd193e78e4575adb]
module.vpc.aws_route_table.private[5]: Refreshing state... [id=rtb-027c5b9b1eb67dea9]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0d4d4b200aefd41b0]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-067bf7d1691134086]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09518df5801cf8b31]
module.vpc.aws_route_table.private[4]: Refreshing state... [id=rtb-0b177960d81a2f1b7]
module.vpc.aws_route_table.private[3]: Refreshing state... [id=rtb-087cf48ecff5bea3d]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0b5922e4433793379]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0f6f3efb89a553c06]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-06f85801b091e2759]
module.vpc.aws_subnet.private[4]: Refreshing state... [id=subnet-04a38528da1dcb2ed]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c035011e361ea452]
module.vpc.aws_subnet.private[3]: Refreshing state... [id=subnet-0253184dc60aaf031]
module.vpc.aws_subnet.private[5]: Refreshing state... [id=subnet-06947ef14298c9e67]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0a5bc5ec073940dca]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0b94d7faf68936e3c]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0a284c52e2f9146f9]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-00dd8e548892facba]
module.acm.aws_route53_record.validation[0]: Refreshing state... [id=Z05346383CF9J3IH2UIOG__7e17ed3c254a4598e2141844c108f21c.capnduck.com._CNAME]
module.acm.aws_route53_record.validation[1]: Refreshing state... [id=Z05346383CF9J3IH2UIOG__c39759b1b4ce68a0a58295c7c4040ee4.www.capnduck.com._CNAME]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-09d42e8fc1a0347af]
module.vpc.aws_route_table_association.private[3]: Refreshing state... [id=rtbassoc-0872b6bcb7685165d]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0b85474b5faae36af]
module.vpc.aws_route_table_association.private[5]: Refreshing state... [id=rtbassoc-0a6ea86a864cfcd34]
module.vpc.aws_route_table_association.private[4]: Refreshing state... [id=rtbassoc-073a8a256a9e206ac]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0bd896340bfa89863]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-00dd8e548892facba1080289494]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0908e20c0a154e529]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0a770f077e552adef]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08aeb7e5177ca14d3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.ecs.aws_ecs_account_setting_default.this will be created
  + resource "aws_ecs_account_setting_default" "this" {
      + id            = (known after apply)
      + name          = "taskLongArnFormat"
      + principal_arn = (known after apply)
      + value         = "enabled"
    }

  # module.ecs.aws_ecs_cluster.this will be updated in-place
  ~ resource "aws_ecs_cluster" "this" {
        id       = "arn:aws:ecs:us-west-2:009727205366:cluster/default"
        name     = "default"
        tags     = {}
        # (2 unchanged attributes hidden)

      ~ configuration {
          ~ execute_command_configuration {
              + kms_key_id = (known after apply)
                # (1 unchanged attribute hidden)

              ~ log_configuration {
                  ~ cloud_watch_log_group_name     = "/aws/ecs/infrastructure" -> "/aws/ecs/cluster/default"
                    # (2 unchanged attributes hidden)
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.ecs.module.kms.aws_kms_alias.this will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/capnduck"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.ecs.module.kms.aws_kms_key.this will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 14
      + description                        = "This key is used to encrypt and decrypt objects."
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = false
      + policy                             = (known after apply)
      + tags                               = {
          + "module" = "aws_kms_key"
        }
      + tags_all                           = {
          + "Name"        = "infra"
          + "environment" = "prod"
          + "module"      = "aws_kms_key"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @jelliottio, Action: `pull_request`*